#include"zzy.h"
//逃亡的汉尼拔博士

int main()
{
	cout<<"选择你要的数据输入方式（文件输入（键入p）||键盘输入（键入q））"<<endl;
	char shape;
	cin>>shape;
	
	if(shape=='q')
	{
		keyboradinput();//键盘输入数据
	}
	else
	{
		if(shape=='p')
		{
			fileInput();//文件输入数据
		
		}
		else
		{
			exit(1);	
		}
		
	}
	return 0;
}
/*
样例值：
2
5 2 0
0 1 1 1 0
1 0 0 0 1
1 0 0 0 0
1 0 0 0 0
0 1 0 0 0
3
0 2 4
8 2 3
0 1 1 1 0 0 0 0
1 0 0 1 0 0 0 0
1 0 0 1 0 0 0 0
1 1 1 0 1 1 0 0
0 0 0 1 0 0 1 1
0 0 0 1 0 0 0 1
0 0 0 0 1 0 0 0
0 0 0 0 1 1 0 0
4
3 1 2 6
示例输出值
0.83333333	0.00000000	0.16666667
0.43333333	0.06666667	0.06666667	0.06666667

*/